import re
# f = open("weather.txt", mode="r", encoding="utf8")
# content = f.read()
# f.close()
content = "Βροχές και καταιγίδες εκδηλώθηκαν κατά τη διάρκεια της Τετάρτης
05/04/2017 στα ηπειρωτικά. Σύμφωνα με το δίκτυο αυτόματων
μετεωρολογικών σταθμών του Εθνικού Αστεροσκοπείου Αθηνών, τα
μεγαλύτερα ύψη βροχόπτωσης καταγράφηκαν στις ακόλουθες περιοχές:
Αράχωβα... 21.2 mm, Αγρίνιο... 20 mm, Πολύδροσο Φωκίδας... 19 mm,
Γαβαλού... 18.8 mm, Λαμία... 16.8 mm, Καραβοστάσι Θεσπρωτίας...
13.8 mm και Αγιά Λάρισας... 12.4 mm. Οι χαμηλότερες ελάχιστες την
Πέμπτη 6/4/2017 καταγράφηκαν στο Χ/Κ Καϊμακτσαλάν (-1.7 C), στη
Βωβούσα Ιωαννίνων (0.7 C), στη Βλάστη Κοζάνης (1.4 C), στο Χ/Κ Σελίου
(1.5 C), στο Χ/Κ Λαϊλιά (1.7 C) και στο Μαυρολιθάρι Φωκίδας - Θέση
Βρύζες (1.9 C). Οι υψηλότερες μέγιστες θερμοκρασίες το μεσημέρι της
Πέμπτης 6/4/2017 καταγράφηκαν στη Λίνδο Ρόδου (24.3 C), στην Καρδίτσα
(24.2 C), στη Σπάρτη και στα Γιαννιτσά (23.8 C), στην Καλαμάτα και
στους Άγιους Θεόδωρους Κορινθίας (23.3 C), στη Βέροια (23.1 C), στη
Λάρισα (22.8 C), στα Τρίκαλα (22.7 C) και στη Σίνδο (22.6 C). (Πηγή:
http://www.meteo.gr)"

"""
Ερώτημα #1
Το πρόγραμμα στην έξοδό του τυπώνει όλους τους φυσικούς αριθμούς από το μηδέν έως το εννιά
που βρίσκονται μέσα στο κείμενο. Η έξοδος είναι οι 75 παρακάτω χαρακτήρες:
['0', '5', '0', '4', '2', '0', '1', '7', '2', '1', '2', '2', '0',
'1', '9', '1', '8', '8', '1', '6', '8', '1', '3', '8', '1', '2', '4',
'6', '4', '2', '0', '1', '7', '1', '7', '0', '7', '1', '4', '1', '5',
'1', '7', '1', '9', '6', '4', '2', '0', '1', '7', '2', '4', '3', '2',
'4', '2', '2', '3', '8', '2', '3', '3', '2', '3', '1', '2', '2', '8',
'2', '2', '7', '2', '2', '6']
75"""

pattern = re.compile("[0-9]")
result = pattern.findall(content)
print(result)
print(len(result))
#==============================================
"""Ερώτημα #2
Για να τυπώνει τυπώνει το πρόγραμμα ολόκληρους τους (πραγματικούς ή ακέραιους) αριθμούς που
εμφανίζονται στο κείμενο χρησιμοποιήσαμε την έκφραση /[-+]?[0-9]+?[0-9]+/. Το πρώτο
ερωτηματικό μας ορίζει την προαιρετική εμφάνιση προσήμου αρνητικών και θετικών αριθμών μέσα στην
επιλογή. Το δεύτερο ερωτηματικό ορίζει την εμφάνιση της υποδιαστολής (τελεία) και την προηγούμενη
τουλάχιστον μια φορά εμφάνισης αριθμών από το ένα έως το εννιά. Τέλος το τελευταίο συν ορίζει την
προαιρετική επιλογή να εμφανιστούν αριθμοί μετά την υποδιαστολή. Η έξοδος του προγράμματος ήταν:
['05', '04', '2017', '21.2', '20', '19', '18.8', '16.8', '13.8',
'12.4', '2017', '-1.7', '0.7', '1.4', '1.5', '1.7', '1.9', '2017',
'24.3', '24.2', '23.8', '23.3', '23.1', '22.8', '22.7', '22.6']
26
/[-+]?[0-9]+?[0-9]+/"""
#==============================================

"""Ερώτημα #3
Για να τυπώνει τυπώνει το πρόγραμμα αριθμούς που εμφανίζονται στο κείμενο και μετά να ακολουθεί
mm χρησιμοποιήσαμε την προηγούμενη έκφραση μαζί με τα mm, δηλαδή /[-+]?[0-9]+?[0-9]+
mm/. Προφανώς τα πρόσημα δεν χρειάζονται εδώ. Η έξοδος του προγράμματος ήταν:
['21.2 mm', '20 mm', '19 mm', '18.8 mm', '16.8 mm', '13.8 mm', '12.4
mm']
7
/[-+]?[0-9]+?[0-9] mm/"""
#==============================================
"""Ερώτημα #4
Για να τυπώνει μόνο τα περιεχόμενα των παρενθέσεων που εμφανίζονται στο κείμενο θα πρέπει να
ορίσουμε ως απλούς χαρακτήρες τις εξωτερικές παρενθέσεις και να ορίσουμε ως ομάδα την ύπαρξη
όλων των πιθανών χαρακτήρων μέσα σε αυτές. Αυτό γίνεται με την έκφραση /\((.*?)\)/
['-1.7 C', '0.7 C', '1.4 C', '1.5 C', '1.7 C', '1.9 C', '24.3 C',
'24.2 C', '23.8 C', '23.3 C', '23.1 C', '22.8 C', '22.7 C', '22.6 C',
'Πηγή: http://www.meteo.gr']
15
/\((.*?)\)/"""
#==============================================
"""Ερώτημα #5
Για να τυπώνει το πρόγραμμα ημερονομηνίες τις μορφής **/**/**** το πρόγραμμα θα ορίσουμε την
έκφραση /[0-9]?[0-9]\/[0-9]?[0-9]\/[0-9][0-9][0-9][0-9]/. Η έκφραση αυτή δεν
βρίσκει ωστόσο έγκυρες ημερομηνίες, απλά μόνο το μοτίβο το οποίο έχουν.
['05/04/2017', '6/4/2017', '6/4/2017']
3
/[0-9]?[0-9]\/[0-9]?[0-9]\/[0-9][0-9][0-9][0-9]/"""
#==============================================
"""Ερώτημα #6
Για να τυπώνει μόνο τις ημερομηνίες που εμφανίζονται στο κείμενο, μαζί με την προηγούμενη
λέξη κάθε ημερομηνίας θα πρέπει να βρούμε λέξεις με το ελληνικό αλφάβητο, να ακολουθεί
κενό και έπειτα το μοτίβο των ημερομηνιών από το προηγούμενο ερώτημα. Αυτό γίνεται με την
έκφραση /[Ά-Ϋ]?[ά-ώ]+ [0-9]?[0-9]\/[0-9]?[0-9]\/[0-9][0-9][0-9][0-9]/.
Οι επιλογές για τα κεφαλαία γράμματα έγιναν με βάση τη σειρά της UTF-8 κωδικοποίησης για τους
ελληνικούς χαρακτήρες. Η έξοδος του προγράμματος είναι:
['Τετάρτης 05/04/2017', 'Πέμπτη 6/4/2017', 'Πέμπτης 6/4/2017']
3
/[Ά-Ϋ]?[ά-ώ]+ [0-9]?[0-9]\/[0-9]?[0-9]\/[0-9][0-9][0-9][0-9]/"""
#==============================================
"""Ερώτημα #7
Για να τυπώνει το πρόγραμμα μόνο τις λέξεις που περιέχουν τονισμένο φωνήεν από το προηγούμενο
ερώτημα θα κρατήσουμε με τουλάχιστον μία εμφάνιση όλες τις πιθανές εμφανίσεις τονισμένων
ελληνικών χαρακτήρων. Επίσης στην αρχή θα έχει προαιρετική εμφάνιση κεφαλαίων και πεζών
χαρακτήρων, ενώ μετά έναν τονισμένο χαρακτήρα θα ακολουθεί πεζός. Η έξοδος του προγράμματος
θα είναι:
['Βροχές', 'καταιγίδες', 'εκδηλώθηκαν', 'κατά', 'διάρκεια',
'Τετάρτης', 'ηπειρωτικά', 'δίκτυο', 'αυτόματων', 'μετεωρολογικών',
'σταθμών', 'Αστεροσκοπείου', 'Αθηνών', 'βροχόπτωσης', 'καταγράφηκαν',
'ακόλουθες', 'περιοχές', 'Αράχωβα', 'Αγρίνιο', 'Φωκίδας', 'Λαμία',
'Καραβοστάσι', 'Θεσπρωτίας', 'Αγιά', 'Λάρισας', 'χαμηλότερες',
'ελάχιστες', 'Πέμπτη', 'καταγράφηκαν', 'Καϊμακτσαλάν', 'Ιωαννίνων',
'Βλάστη', 'Κοζάνης', 'Σελίου', 'Λαϊλιά', 'Μαυρολιθάρι', 'Φωκίδας',
'Θέση', 'υψηλότερες', 'μέγιστες', 'θερμοκρασίες', 'μεσημέρι',
'Πέμπτης', 'καταγράφηκαν', 'Λίνδο', 'Ρόδου', 'Καρδίτσα', 'Σπάρτη',
'Γιαννιτσά', 'Καλαμάτα', 'Άγιους', 'Θεόδωρους', 'Κορινθίας',
'Βέροια', 'Λάρισα', 'Τρίκαλα', 'Σίνδο', 'Πηγή']
58
/[Ά-ώ]*[ΆΊΉΎΏΈΌΪΫάέίήόώϋϊΐΰ]+[α-ω]*/"""
#==============================================
"""Ερώτημα #8
Για να τυπώνει μόνο τις λέξεις που ξεκινούν με κεφαλαίο γράμμα και έχουν μήκος τουλάχιστον τρεις
χαρακτήρες η έκφραση θα πρέπει να αρχίζει με τουλάχιστον ένα κεφαλαίο, να συνεχίζει με τουλάχιστον
δύο πεζά γράμματα. Οπότε η έκφραση θα γίνει /[Ά-Ϋ]+[ά-ώ]+[ά-ώ]+/. Η έξοδος θα είναι:
['Βροχές', 'Τετάρτης', 'Σύμφωνα', 'Εθνικού', 'Αστεροσκοπείου',
'Αθηνών', 'Αράχωβα', 'Αγρίνιο', 'Πολύδροσο', 'Φωκίδας', 'Γαβαλού',
'Λαμία', 'Καραβοστάσι', 'Θεσπρωτίας', 'Αγιά', 'Λάρισας', 'Πέμπτη',
'Καϊμακτσαλάν', 'Βωβούσα', 'Ιωαννίνων', 'Βλάστη', 'Κοζάνης',
'Σελίου', 'Λαϊλιά', 'Μαυρολιθάρι', 'Φωκίδας', 'Θέση', 'Βρύζες',
'Πέμπτης', 'Λίνδο', 'Ρόδου', 'Καρδίτσα', 'Σπάρτη', 'Γιαννιτσά',
'Καλαμάτα', 'Άγιους', 'Θεόδωρους', 'Κορινθίας', 'Βέροια', 'Λάρισα',
'Τρίκαλα', 'Σίνδο', 'Πηγή']
43
/[Ά-Ϋ]+[ά-ώ]+[ά-ώ]+/"""